app/Controllers/Auth.php

SELECT *
FROM `staff`
WHERE `email` = 'bianalbaihaqi@gmail.com'
AND `staff`.`deleted_at` IS NULL
 LIMIT 1
---
    public function login()
    {
        $post = $this->request->getpost();
        $datapost = $this->staffmodel->where(['email' => $post['email']])->first();