app/Controllers/Book.php

SELECT `book`.`id` as `id`, `book`.`title`, `book`.`author`, `book`.`publication_year`, `publisher`.`name`, `category`.`category`, `book`.`quantity`
FROM `book`
LEFT JOIN `publisher` ON `book`.`id_publisher`=`publisher`.`id`
LEFT JOIN `category` ON `book`.`id_category`=`category`.`id`
WHERE `book`.`deleted_at` IS NULL
---
    public function index()
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda harus login');
        }
        $data = array(
            'book' => $this->bookModel
                ->select('book.id as id,book.title,book.author,book.publication_year,publisher.name,category.category,book.quantity')
                ->join('publisher', 'book.id_publisher=publisher.id', 'left')
                ->join('category', 'book.id_category=category.id', 'left')
                ->findAll()
        );

INSERT INTO `book` (`title`, `author`, `publication_year`, `id_publisher`, `id_category`, `quantity`, `created_at`, `updated_at`) VALUES ('Bleach', 'Tite Kubo', '2001', '6', '4', '5', '2023-05-17 11:46:53', '2023-05-17 11:46:53')
---
            return redirect()->to('book-add')->withInput();
        }

        $this->bookModel->save([
            'title' => $post['title'],
            'author' => $post['author'],
            'publication_year' => $post['publication_year'],
            'id_publisher' => $post['id_publisher'],
            'id_category' => $post['id_category'],
            'quantity' => $post['quantity'],
        ]);

UPDATE `book` SET `deleted_at` = '2023-05-16 12:31:19', `updated_at` = '2023-05-16 12:31:19'
WHERE `id` IN ('3')
AND `deleted_at` IS NULL
---
    public function del($id)
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda Harus Login');
        }

        $delete = $this->bookModel->delete($id);