app/Controllers/Borrower.php

SELECT *
FROM `borrower`
WHERE `borrower`.`deleted_at` IS NULL
---
    public function index()
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda Harus Login');
        }
        $data = array(
            'borrower' => $this->borrowermodel->findAll(),
        );