app/Controllers/Borrow.php

    public function index()
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda harus login');
        }
        $data = array(
            'borrow' => $this->borrowModel
                ->select('borrow.id as id,borrower.name,book.title,staff.name as staff,borrow.release_date,borrow.due_date,borrow.note')
                ->join('borrower', 'borrow.id_borrower=borrower.id', 'left')
                ->join('book', 'borrow.id_book=book.id', 'left')
                ->join('staff', 'borrow.id_staff=staff.id', 'left')
                ->findAll()
        );
---
SELECT `borrow`.`id` as `id`, `borrower`.`name`, `book`.`title`, `staff`.`name` as `staff`, `borrow`.`release_date`, `borrow`.`due_date`, `borrow`.`note`
FROM `borrow`
LEFT JOIN `borrower` ON `borrow`.`id_borrower`=`borrower`.`id`
LEFT JOIN `book` ON `borrow`.`id_book`=`book`.`id`
LEFT JOIN `staff` ON `borrow`.`id_staff`=`staff`.`id`
WHERE `borrow`.`deleted_at` IS NULL

    public function add()
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda harus login');
        }

        $data = array(
            'borrower' => $this->borrowerModel->findAll(),
            'book' => $this->bookModel->findAll(),
            'staff' => $this->staffModel->findAll(),
        );
---
SELECT *
FROM `borrower`
WHERE `borrower`.`deleted_at` IS NULL
SELECT *
FROM `book`
WHERE `book`.`deleted_at` IS NULL
SELECT *
FROM `staff`
WHERE `staff`.`deleted_at` IS NULL