app/Controllers/Category.php

SELECT *
FROM `category`
WHERE `category`.`deleted_at` IS NULL
---
    public function index()
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda Harus Login');
        }
        $data = array(
            'category' => $this->categorymodel->findAll(),
        );

INSERT INTO `category` (`category`, `created_at`, `updated_at`) VALUES ('book', '2023-05-15 11:21:12', '2023-05-15 11:21:12')
---
    public function addpro()
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda Harus Login');
        }

        $post = $this->request->getPost();

        if (!$this->validate([
            'category' => [
                'rules' => 'required',
                'errors' => ['required' => 'wajib diisi'],
            ],
        ])) {
            $validation = \config\Services::validation();
            session()->setFlashdata('validation', $validation->getErrors());
            return redirect()->to('category-add')->withInput();
        }

        $this->categorymodel->save([
            'category' => $post['category'],
        ]);

SELECT *
FROM `category`
WHERE `id` = '1'
AND `category`.`deleted_at` IS NULL
 LIMIT 1
---
    public function edit($id)
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda Harus Login');
        }

        $data = array(
            'item' => $this->categorymodel->where(['id' => $id])->first(),
            'id' => $id,
        );

SELECT *
FROM `category`
WHERE `id` = '1'
AND `category`.`deleted_at` IS NULL
 LIMIT 1
UPDATE `category` SET `category` = 'book', `updated_at` = '2023-05-15 11:27:16'
WHERE `category`.`id` IN ('1')
---
    public function editpro()
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda Harus Login');
        }

        $post = $this->request->getPost();
        $datapost = $this->categorymodel->where(['id' => $post['id']])->first();

        if ($post['category'] == $datapost['category']) {
            if (!$this->validate([
                'category' => [
                    'rules' => 'required',
                    'errors' => ['required' => 'wajib diisi'],
                ],
            ])) {
                $validation = \config\Services::validation();
                session()->setFlashdata('validation', $validation->getErrors());
                return redirect()->to('category-add')->withInput();
            }
            $this->categorymodel->save([
                'id'    => $post['id'],
                'category' => $post['category'],
            ]);

UPDATE `category` SET `deleted_at` = '2023-05-15 11:27:30', `updated_at` = '2023-05-15 11:27:30'
WHERE `id` IN ('1')
AND `deleted_at` IS NULL
---
    public function del($id)
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda Harus Login');
        }

        $delete = $this->categorymodel->delete($id);