app/Controllers/Home.php

    public function home()
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda Harus Login');
        }

        $data = array(
            'qstaff' => $this->staffmodel->countAllResults(),
            'qborrower' => $this->borrowermodel->countAllResults(),
            'qbook' => $this->bookmodel->countAllResults(),
            'qpublisher' => $this->publishermodel->countAllResults(),
            'qcategory' => $this->categorymodel->countAllResults(),
            'qborrow' => $this->borrowmodel->countAllResults(),
        );
---
SELECT COUNT(*) AS `numrows`
FROM `staff`
WHERE `staff`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `borrower`
WHERE `borrower`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `book`
WHERE `book`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `publisher`
WHERE `publisher`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `category`
WHERE `category`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `borrow`
WHERE `borrow`.`deleted_at` IS NULL