app/Controllers/publisher.php

    public function index()
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda Harus Login');
        }
        $data = array(
            'publisher' => $this->publishermodel->findAll(),
        );
---
SELECT *
FROM `publisher`
WHERE `publisher`.`deleted_at` IS NULL