app/Controllers/staff.php

SELECT *
FROM `staff`
WHERE `staff`.`deleted_at` IS NULL
---
    public function index()
    {
        if (!session('id')) {
            return redirect()->to(base_url())->with('error', 'Anda Harus Login');
        }
        $data = array(
            'staff' => $this->staffmodel->findAll(),
        );